Revit 2027 API
SunAndShadowSettings.Azimuth Property
 Azimuth setting (angle in radians). This is only relevant when dealing with a SunAndShadowSettings element that uses lighting mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Azimuth { get; set; }
Public Property Azimuth As Double
	Get
	Set
public:
property double Azimuth {
	double get ();
	void set (double value);
}
member Azimuth : float with get, set
Property Value
Double
 Azimuth angle (radians)
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace